using System.Collections;
using System.Collections.Generic;
using UnityEngine;
using UnityEngine.EventSystems;
[System.Serializable]
public class questions : MonoBehaviour {
	
	public quiz[] math=new quiz[10];
	public quiz[] info=new quiz[10];
	public quiz[] russ=new quiz[10];
	// Use this for initialization
	void Start () {
		//MATH
		math [0] = new quiz (0,"Чему равно sin(30)+сos(2pi)-ctg(pi/4)+1/2","0","1","1/2","3/2",2);
		math [1] = new quiz (1,"Что такое логарифм числа b по основанию a?","Показатель степени, в которую нужно возвести a, чтобы получить b","Показатель степени, в которую нужно возвести b, чтобы получить a","Число a в степени b","Не знаю",1);
		math [2] = new quiz (2,"Укажите иррациональное число","2*2","234","17/18","sqrt(2)",4);

		//INFORMATICS
		info [0] = new quiz (0,"Что такое массив?","Элемент базы данных","Переменная вида string","структура данных","Высокая часть горной местности",3);
		info [1] = new quiz (1,"Чем является TCP?","основной протокол передачи данных в интернете","Маршрутизированный сетевой протокол, основа ip","Протокол пользовательских датаграмм","Интерфейс для связи устройств",1);
		info [2] = new quiz (2,"Что такое html?","Язык программирования","Библиотека в с++","Язык сетевых взаимодействий","Стандартизированный язык разметки документов в Интернете",4);


		//RUSSIAN LANGUAGE
		russ [0] = new quiz (0,"Выберите неверно выделенное ударение в слове","ненАдолго","Иксы","понялА","снятА",1);
		russ [1] = new quiz (1,"Выберите неверно выделенное ударение в слове","рвалА","прибылА","налилА","клалА",4);
		russ [2] = new quiz (2,"Выберите неверно выделенное ударение в слове","звонИшь","принЯвший","начАв","пОняв",4);

		//ENGLISH

	}
	
	// Update is called once per frame
	void Update () {
		
	}
}
